"""""
Задание 3.
Узнайте у пользователя целое положительное число n.
Найдите сумму чисел n + nn + nnn.
"""""
number = int(input("введите любое положительное целое число"))
a = number
b = number * 2
c = number * 3
print(str(a) + str(b) + str(c))

