'''''
Задание 1.
Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.
'''''
a = 123
b = 'number'
c = '657'
x = 3.14
print(a)
print(b + c)
print(a + x)
ferst_number = int(input("введите любое число"))
next_number = input("введите число буквами")
print(ferst_number, next_number)
